app/controllers/users_controller.rb

    def create
      user = User.new(user_params)
      if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "John Doe"], ["email", "john@example.com"], ["created_at", "2023-05-24 06:51:32.512975"], ["updated_at", "2023-05-24 06:51:32.512975"]]